### Vaishna Subbaiah
#### 12/3/25
###### Final Project - Milestone #3

In [1]:
import pandas as pd

In [2]:
#Load data 
df = pd.read_csv("import_all_commodities.csv")

In [27]:
df.tail(15)

     year month  value
115  2020   Nov  123.4
116  2021   Nov  137.9
117  2022   Nov  141.6
118  2023   Nov  139.4
119  2024   Nov  141.3
121  2015   Dec  119.3
122  2016   Dec  121.6
123  2017   Dec  125.5
124  2018   Dec  124.4
125  2019   Dec  125.0
126  2020   Dec  124.6
127  2021   Dec  137.4
128  2022   Dec  141.8
129  2023   Dec  138.4
130  2024   Dec  141.4

##### I started out by using .head() because I wanted to see what I was working with

#### Cleaning data

In [4]:
df.columns = (
    df.columns
    .str.lower()
)
df.columns

Index(['year', 'month', 'value'], dtype='object')

##### Then I took the columns and made them all lowercase for simplicity

#### Check for missing values

In [5]:
df.isna().sum()

year     0
month    0
value    4
dtype: int64

##### There are 4 missing values in the dataset. Upon further investigation, I learned that the missing values were from the last 4 months of 2025 (September, October, November, and December). They are missing because there isn't available data about those imports yet. In the cell below, I am removing the values associated with the year 2025. The graphs of my questions would look better if I used years to differentiate the data instead of months. If I kept 2025 in, but took out the 4 months that had missing values, the graphs wouldn't be accurate as 2025 would have a significantly less amount of data.

In [6]:
df = df[df["year"] != 2025]

###### Checking for missing values after removing 2025 data

In [7]:
df.isna().sum()

year     0
month    0
value    0
dtype: int64

In [9]:
df.duplicated().sum()

np.int64(0)

#### Dropping any Na's if necessary

In [10]:
df = df.dropna()

#### Getting a Statistical Summary

In [13]:
df.describe()

              year      value
count   120.000000  120.00000
mean   2019.500000  130.07750
std       2.884324    8.70364
min    2015.000000  117.20000
25%    2017.000000  123.20000
50%    2019.500000  126.50000
75%    2022.000000  139.70000
max    2024.000000  148.50000

#### Checking the first few lines

In [14]:
df.head()

   year month  value
0  2015   Jan  126.0
1  2016   Jan  117.8
2  2017   Jan  122.3
3  2018   Jan  126.5
4  2019   Jan  124.6

#### Making sure 2025 is not included in the data set

In [23]:
df.head(12)

    year month  value
0   2015   Jan  126.0
1   2016   Jan  117.8
2   2017   Jan  122.3
3   2018   Jan  126.5
4   2019   Jan  124.6
5   2020   Jan  125.2
6   2021   Jan  126.5
7   2022   Jan  140.1
8   2023   Jan  141.3
9   2024   Jan  139.4
11  2015   Feb  125.5
12  2016   Feb  117.2

#### Checking Data Types and Missing Values

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 120 entries, 0 to 130
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    120 non-null    int64
 1   month   120 non-null    object
 2   value   120 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.8+ KB

### For any questions I had, I used Google Gemini, Chat GPT, and my classmates (Jismi)